### <font color="brown">Relational Databases Continued</font>

---

#### <font color="brown">Queries on the nobels database</font>

##### **The table schemas**

<pre>
mysql> desc yearcat;
+----------+----------+------+-----+---------+----------------+
| Field    | Type     | Null | Key | Default | Extra          |
+----------+----------+------+-----+---------+----------------+
| id       | smallint | NO   | PRI | NULL    | auto_increment |
| year     | year     | NO   |     | NULL    |                |
| category | char(10) | NO   |     | NULL    |                |
+----------+----------+------+-----+---------+----------------+
3 rows in set (0.00 sec)

mysql> desc contribution;
+------------+--------------+------+-----+---------+----------------+
| Field      | Type         | Null | Key | Default | Extra          |
+------------+--------------+------+-----+---------+----------------+
| id         | smallint     | NO   | PRI | NULL    | auto_increment |
| motivation | varchar(500) | NO   |     | NULL    |                |
+------------+--------------+------+-----+---------+----------------+
2 rows in set (0.00 sec)

mysql> desc laureate;
+-------------+-------------+------+-----+---------+-------+
| Field       | Type        | Null | Key | Default | Extra |
+-------------+-------------+------+-----+---------+-------+
| fname       | varchar(80) | NO   |     | NULL    |       |
| lname       | varchar(40) | YES  |     | NULL    |       |
| share       | tinyint     | NO   |     | NULL    |       |
| year_cat_id | smallint    | NO   | MUL | NULL    |       |
| motiv_id    | smallint    | NO   | MUL | NULL    |       |
+-------------+-------------+------+-----+---------+-------+
5 rows in set (0.00 sec)
</pre>

---

##### <font color="brown">5. In the year 2000 how many people shared the prize in each category except Peace?  (as, group by)</font>

<pre>
mysql> select Y.category, count(*) as 'number of laureates'
       from yearcat Y, laureate L
       where Y.year=2000
             and Y.category != 'Peace' 
             and Y.id=L.year_cat_id 
       group by category;

+------------+---------------------+
| category   | number of laureates |
+------------+---------------------+
| Chemistry  |                   3 |
| Economics  |                   2 |
| Literature |                   1 |
| Physics    |                   3 |
| Medicine   |                   3 |
+------------+---------------------+
</pre>

- The *as* feature is used to name a result column, otherwise here it will be named 'count(\*)' which is not descriptive
- The *group by* clause is mcuh like the Pandas DataFrame <tt>groupby</tt> method.

---

##### <font color="brown">6a. In the years 2016-2020 how many people shared the prize in each category except Peace? (group by on 2 levels)</font>

<pre>
mysql> select Y.year, Y.category, count(category) as 'number of laureates'
       from yearcat Y, laureate L
       where Y.year between 2016 and 2020 
             and Y.category != 'Peace' 
             and Y.id=L.year_cat_id 
       group by Y.year, Y.category;

+------+------------+---------------------+
| year | category   | number of laureates |
+------+------------+---------------------+
| 2020 | Chemistry  |                   2 |
| 2020 | Economics  |                   2 |
| 2020 | Literature |                   1 |
| 2020 | Physics    |                   3 |
| 2020 | Medicine   |                   3 |
| 2019 | Chemistry  |                   3 |
| 2019 | Economics  |                   3 |
| 2019 | Literature |                   1 |
| 2019 | Physics    |                   3 |
| 2019 | Medicine   |                   3 |
| 2018 | Chemistry  |                   3 |
| 2018 | Economics  |                   2 |
| 2018 | Literature |                   1 |
| 2018 | Physics    |                   3 |
| 2018 | Medicine   |                   2 |
| 2017 | Chemistry  |                   3 |
| 2017 | Economics  |                   1 |
| 2017 | Literature |                   1 |
| 2017 | Physics    |                   3 |
| 2017 | Medicine   |                   3 |
| 2016 | Chemistry  |                   3 |
| 2016 | Economics  |                   2 |
| 2016 | Literature |                   1 |
| 2016 | Physics    |                   3 |
| 2016 | Medicine   |                   1 |
+------+------------+---------------------+
</pre>
First group by year, then within each year group by category.

---

<font color="brown">6b. In the years 2016-2020 (list chronologically) how many people shared the prize in each category except Peace? 
(order by)</font>

<pre>
mysql> select Y.year, Y.category, count(category) as 'number of laureates'
       from yearcat Y, laureate L
       where Y.year between 2016 and 2020 
             and Y.category != 'Peace' 
             and Y.id=L.year_cat_id 
       group by Y.year, Y.category
       order by Y.year;
       
+------+------------+---------------------+
| year | category   | number of laureates |
+------+------------+---------------------+
| 2016 | Chemistry  |                   3 |
| 2016 | Economics  |                   2 |
| 2016 | Literature |                   1 |
| 2016 | Medicine   |                   1 |
| 2016 | Physics    |                   3 |
| 2017 | Chemistry  |                   3 |
| 2017 | Economics  |                   1 |
| 2017 | Literature |                   1 |
| 2017 | Medicine   |                   3 |
| 2017 | Physics    |                   3 |
| 2018 | Chemistry  |                   3 |
| 2018 | Economics  |                   2 |
| 2018 | Literature |                   1 |
| 2018 | Medicine   |                   2 |
| 2018 | Physics    |                   3 |
| 2019 | Chemistry  |                   3 |
| 2019 | Economics  |                   3 |
| 2019 | Literature |                   1 |
| 2019 | Medicine   |                   3 |
| 2019 | Physics    |                   3 |
| 2020 | Chemistry  |                   2 |
| 2020 | Economics  |                   2 |
| 2020 | Literature |                   1 |
| 2020 | Medicine   |                   3 |
| 2020 | Physics    |                   3 |
+------+------------+---------------------+       
</pre>

---

<font color="brown">7. List the years and number of laureates when the Chemistry prize was shared by more than 2 winners.
(having)</font>

<pre>
mysql> select Y.year, count(*) as laureates
       from yearcat Y, laureate L
       where Y.category = 'Chemistry'
             and Y.id = L.year_cat_id
       group by Y.year
       having count(*) > 2
       
+------+-----------+
| year | laureates |
+------+-----------+
| 2019 |         3 |
| 2018 |         3 |
| 2017 |         3 |
| 2016 |         3 |
| 2015 |         3 |
| 2014 |         3 |
| 2013 |         3 |
| 2010 |         3 |
| 2009 |         3 |
| 2008 |         3 |
| 2005 |         3 |
| 2004 |         3 |
| 2002 |         3 |
| 2001 |         3 |
| 2000 |         3 |
| 1997 |         3 |
| 1996 |         3 |
| 1995 |         3 |
| 1988 |         3 |
| 1987 |         3 |
| 1986 |         3 |
| 1980 |         3 |
| 1972 |         3 |
| 1967 |         3 |
| 1946 |         3 |
+------+-----------+   
</pre>
- The *having* condition applies to each group

---

---

### <font color="brown">College database</font>

#### <font color="brown">Create a college database and give access to local user</font>

<pre>
sesh> mysql -u root -p mysql
mysql> create database college;
mysql> grant all on college.* to 'sesh'@'localhost';
mysql> exit
</pre>

---

#### <font color="brown">Set up the following schema for the college database</font>

<pre>
sesh> mysql -u sesh -p college
</pre>

##### 1. Student(Id, Name, Major, Year, Age)
<pre>
   create table Student(
       Id int primary key, 
       Name varchar(20) not null, 
       Major varchar(20) not null,
       Year enum('FR','SO','JR','SR','GR') not null default 'FR',
       Age tinyint not null);
</pre>

##### 2. Class(CName, Time, Room)
<pre>
   create table Class(
       CName varchar(10) primary key,
       Time char(4) not null,
       Room varchar(20) not null);
</pre>

##### 3. Enrollment(SId, CName, Pos)
<pre>
   create table Enrollment(
       SId int not null,
       CName varchar(10) not null,
       Pos smallint not null,
       foreign key (SId) references Student(Id),
       foreign key (CName) references Class(CName));
</pre>

##### 4. HonorStudent(SId)
<pre>
   create table HonorStudent (
       SId int not null, 
       foreign key (SId) references Student(Id));
</pre>

---

#### <font color="brown">Populate the database</font>

In [4]:
# import connector module
import mysql.connector

In [5]:
# connect to college database
mydb = mysql.connector.connect(
  host="localhost",
  user="sesh",
  passwd="sesh",  # replace with your password
  database="college"
)

In [6]:
# set up for access
cursor = mydb.cursor()

#### Student table

In [7]:
# Dataset for Student table
students = [
    (100, 'Perez', 'Math', 'JR', 21),
    (150, 'Patel', 'CS', 'SO', 19),
    (200, 'Eastwood', 'Physics', 'GR', 26),
    (250, 'Chen', 'English', 'SR', 22),
    (300, 'Madsen', 'History', 'FR', 18),
    (350, 'Harris', 'Chemistry', 'SR', 21),
    (400, 'Bakalova', 'Economics', 'GR', 24)
]
add_student = "insert into Student values (%s, %s, %s, %s, %s)"
for student in students:
    cursor.execute(add_student, student)
    mydb.commit()

In [8]:
def doquery(query):
    cursor.execute(query)
    res = cursor.fetchall()
    for row in res:
        print(row)

In [9]:
doquery("select * from Student")

(100, 'Perez', 'Math', 'JR', 21)
(150, 'Patel', 'CS', 'SO', 19)
(200, 'Eastwood', 'Physics', 'GR', 26)
(250, 'Chen', 'English', 'SR', 22)
(300, 'Madsen', 'History', 'FR', 18)
(350, 'Harris', 'Chemistry', 'SR', 21)
(400, 'Bakalova', 'Economics', 'GR', 24)

#### Class table

In [10]:
# Dataset for Class table
classes = [
    ('Math 311', 'MW5', 'Liv'),
    ('CS 210', 'MW4', 'Remote'),
    ('CS 213', 'Any', 'Remote'),
    ('CS 323', 'TTh8', 'Busch'),
    ('Phy 421', 'TTh4', 'Busch'),
    ('Phy 605', 'TTh6', 'Busch'),
    ('Econ 607', 'MTh4', 'CAC'),
    ('Eng 256', 'TTh5', 'CAC'),
    ('Eng 316', 'MTH3', 'CAC'),
    ('Hist 401', 'Any', 'CAC'),
    ('Chem 422', 'MW2', 'Busch'),
    ('Hist 102', 'Any', 'CAC'),
    ('Econ 586', 'TTh6', 'CAC' )
]
add_class = "insert into Class values (%s, %s, %s)"
for aclass in classes:
    cursor.execute(add_class, aclass)
    mydb.commit()

In [11]:
doquery("select * from Class")

('Chem 422', 'MW2', 'Busch')
('CS 210', 'MW4', 'Remote')
('CS 213', 'Any', 'Remote')
('CS 323', 'TTh8', 'Busch')
('Econ 586', 'TTh6', 'CAC')
('Econ 607', 'MTh4', 'CAC')
('Eng 256', 'TTh5', 'CAC')
('Eng 316', 'MTH3', 'CAC')
('Hist 102', 'Any', 'CAC')
('Hist 401', 'Any', 'CAC')
('Math 311', 'MW5', 'Liv')
('Phy 421', 'TTh4', 'Busch')
('Phy 605', 'TTh6', 'Busch')

#### Enrollment table

In [12]:
enrolls = [
    (100, 'Math 311', 1),
    (100, 'CS 210', 3),
    (150, 'CS 210', 2),
    (150, 'CS 213', 5),
    (150, 'CS 323', 1),
    (150, 'Math 311', 10),
    (200, 'Phy 605', 3),
    (200, 'CS 323', 2),
    (250, 'Eng 256', 8),
    (250, 'Eng 316', 7),
    (250, 'CS 213', 26),
    (300, 'Hist 102', 24),
    (300, 'CS 210', 6),
    (350, 'Chem 422', 14),
    (350, 'Hist 401', 2),
    (400, 'Econ 586', 1),
    (400, 'Econ 607',4)
]
add_enrollment = "insert into Enrollment values (%s, %s, %s)"
for enroll in enrolls:
    cursor.execute(add_enrollment, enroll)
    mydb.commit()

In [13]:
doquery("select * from Enrollment")

(100, 'Math 311', 1)
(100, 'CS 210', 3)
(150, 'CS 210', 2)
(150, 'CS 213', 5)
(150, 'CS 323', 1)
(150, 'Math 311', 10)
(200, 'Phy 605', 3)
(200, 'CS 323', 2)
(250, 'Eng 256', 8)
(250, 'Eng 316', 7)
(250, 'CS 213', 26)
(300, 'Hist 102', 24)
(300, 'CS 210', 6)
(350, 'Chem 422', 14)
(350, 'Hist 401', 2)
(400, 'Econ 586', 1)
(400, 'Econ 607', 4)

#### HonorStudent table

In [14]:
add_honorstudent = "insert into HonorStudent values (%s)"
for id in [(100,),(150,),(250,)]:
    cursor.execute(add_honorstudent, id)
    mydb.commit();

In [15]:
doquery("select * from HonorStudent")

(100,)
(150,)
(250,)

---

#### <font color="brown">Do Queries on the database</font>

---

#### <font color="brown">String Wildcarding</font>

##### **1. Find all CS classes**
<pre>
  select * from Class where CName like 'CS%';
</pre>
(All classes that start with 'CS', % matches 0 or more characters)

In [17]:
query = 'select * from Class where CName like \'CS%\''
doquery(query)

('CS 210', 'MW4', 'Remote')
('CS 213', 'Any', 'Remote')
('CS 323', 'TTh8', 'Busch')

Strings in MySQL are <b>case-insensitive</b>, so using 'cs' instead of 'CS' will work the same way:
<pre>
  select * from Class where CName like 'cs%';
</pre>

In [18]:
query = 'select * from Class where CName like \'cs%\''
doquery(query)

('CS 210', 'MW4', 'Remote')
('CS 213', 'Any', 'Remote')
('CS 323', 'TTh8', 'Busch')

##### **2. Find all classes that meet on Thursday**
<pre>
  select CName, Time from Class where Time like '%Th%'
</pre>
(All classes that start with 'CS', % matches anything that follows)

In [19]:
query = "select CName, Time from Class where Time like '%Th%'"
doquery(query)

('CS 323', 'TTh8')
('Econ 586', 'TTh6')
('Econ 607', 'MTh4')
('Eng 256', 'TTh5')
('Eng 316', 'MTH3')
('Phy 421', 'TTh4')
('Phy 605', 'TTh6')

##### **3. Find all 300-level classes**
<pre>
  select * from Class where CName like '%3__'
</pre>
(The pattern is written with 2 underscores, one for each character following 3: 3 \_ \_. Underscore matches a single character.)

In [20]:
query = "select * from Class where CName like '%3__'"
doquery(query)

('CS 323', 'TTh8', 'Busch')
('Eng 316', 'MTH3', 'CAC')
('Math 311', 'MW5', 'Liv')

---

#### <font color="brown">Nested Select</font>

##### **1. Find all students who are older than Chen**
<pre>
  select Name from Student 
  where Age > 
  (select Age from Student where Name = 'Chen')
</pre>

In [16]:
query = """select Name from Student 
           where Age > 
           (select Age from Student where Name='Chen')""" 
doquery(query)

('Eastwood',)
('Bakalova',)

---

#### <font color="brown">Set Operations</font>

##### **1. Find names of students who are either sophomores or honor students**
<pre>
   (select Name from Student where Year='SO') 
      union
   (select Name from Student S, HonorStudent H where H.sid=S.id)
</pre>
- Parentheses around each of the select statements are optional
- Names of tables and columns are case-insensitive, so you can do everything in lower case, if you would like:

<pre>
select name from student where year='so' union 
select name from student S, honorstudent H where H.sid=S.id
</pre>

In [21]:
query = """(select Name from Student where Year='SO') 
          union
           (select Name from Student S, HonorStudent H where H.sid=S.id)"""
doquery(query)

('Patel',)
('Perez',)
('Chen',)

---

##### **2. Find names of senior honor students**

The following won't work, because there is no set intersect feature:
<pre>
   (select Name from Student where Year='SR') 
      intersect
   (select Name from Student S, HonorStudent H where H.sid=S.id)
</pre>
But we can do it a couple of other ways:
- **Using join**

<pre>
   select Name from Student S, HonorStudent H where Year='SR' and S.id=H.sid
</pre>

- **Using set membership**

<pre>
   select Name from Student where Year='SR' and Id in (select SId from HonorStudent);  
</pre>
-  Parentheses around the second select are required.

In [22]:
query = "select Name from Student where Year='SR' and Id in (select SId from HonorStudent)"
doquery(query)

('Chen',)

---

##### **3. Find names of seniors who are not honor students**

The following won't work, because there is no set difference feature:
<pre>
   (select Name from Student where Year='SR') 
      difference
   (select Name from Student S, HonorStudent H where H.sid=S.id)
</pre>
But we can do it using set membership:
<pre>
   select Name from Student S 
   where Year='SR' 
   and Name not in 
     (select Name from Student S, HonorStudent H where S.id=H.sid)
</pre>

In [23]:
query="""select Name from Student S 
         where Year='SR' 
         and Name not in 
             (select Name from Student S, HonorStudent H where S.id=H.sid)"""
doquery(query)

('Harris',)

---

##### **4. Find ids of all students who are taking all CS classes**

The strategy is to find all CS classes, then subtract from it all CS classes taken by a student. If there is anything left after subtraction, it means the student is at least one CS class short. In the result, only include students for which the subtraction is an empty set: "exists" tests if a set is non-empty

<pre>
   select distinct E.sid from Enrollment E 
   where not exists 
     (select CName from Class where CName like 'CS%' 
      and CName not in 
        (select F.CName from Enrollment F where F.sid=E.sid))
</pre>

In [24]:
query="""select distinct E.sid from Enrollment E 
   where not exists 
     (select CName from Class where CName like 'CS%' 
      and CName not in 
        (select F.CName from Enrollment F where F.sid=E.sid))"""
doquery(query)

(150,)

##### **5. Redo above to get names of students, instead of ids**

<pre>
   select distinct S.Name from Student S, Enrollment E 
   where S.id = E.sid and not exists 
     (select CName from Class where CName like 'CS%' 
      and CName not in 
        (select F.CName from Enrollment F where F.sid=E.sid))
</pre>

In [27]:
query="""select distinct Name from Student S, Enrollment E 
   where S.id=E.sid and not exists 
     (select CName from Class where CName like 'CS%' 
      and CName not in 
        (select F.CName from Enrollment F where F.sid=E.sid))"""
doquery(query)

('Patel',)

---

#### <font color="brown">Order By</font>

##### **1. List students by age**
<pre>
   select Name,Age from Student order by Age
</pre>
You can say 'order by Age asc' but the ascending order is the default, so can be omitted

In [28]:
query='select Name,Age from Student order by Age'
doquery(query)

('Madsen', 18)
('Patel', 19)
('Perez', 21)
('Harris', 21)
('Chen', 22)
('Bakalova', 24)
('Eastwood', 26)

##### **2. List CS class enrollments in alphabetical order of class names, and descending order of student positions within each class**

<pre>
select * from Enrollment 
where CName like 'CS%'
order by CName, Pos desc
</pre>

In [30]:
query="""select * from Enrollment
         where CName like 'CS%' 
         order by CName, Pos desc"""
doquery(query)

(300, 'CS 210', 6)
(100, 'CS 210', 3)
(150, 'CS 210', 2)
(250, 'CS 213', 26)
(150, 'CS 213', 5)
(200, 'CS 323', 2)
(150, 'CS 323', 1)

---

#### <font color="brown">Aggregation/Reduction</font>

##### **1. Find the average student age by year**
<pre>
  select Year, avg(age) 
  from Student 
  group by Year
</pre>

In [31]:
query='select Year, avg(age) from Student group by Year'
cursor.execute(query)
res = cursor.fetchall()
for row in res:
    print(f'{row[0]}  {row[1]:.1f}')

JR  21.0
SO  19.0
GR  25.0
SR  21.5
FR  18.0

##### **2. Get the enrollment counts for classes**
<pre>
  select CName, count(*) 
  from Enrollment 
  group by CName
</pre>

In [32]:
query='select CName, count(*) from Enrollment group by CName'
doquery(query)

('Chem 422', 1)
('CS 210', 3)
('CS 213', 2)
('CS 323', 2)
('Econ 586', 1)
('Econ 607', 1)
('Eng 256', 1)
('Eng 316', 1)
('Hist 102', 1)
('Hist 401', 1)
('Math 311', 2)
('Phy 605', 1)

##### **3. Get the enrollment counts for classes that have at least 2 students**
<pre>
  select CName, count(*) 
  from Enrollment 
  group by CName 
  having count(*) > 1
</pre>

In [24]:
query='select CName, count(*) from Enrollment group by CName having count(*) > 1'
doquery(query)

('CS 210', 3)
('CS 213', 2)
('CS 323', 2)
('Math 311', 2)

##### **4. Find the name and id of the youngest student**
<pre>
  select Name,Id from Student 
  where Age in 
  (select min(Age) from Student)
</pre>

In [33]:
query="""select Name,Id from Student 
  where Age in 
  (select min(Age) from Student)"""
doquery(query)

('Madsen', 300)

Alternatively, you can do this:
<pre>
  select Name,Id from Student 
  where Age &lt;= all
  (select Age from Student)
</pre>

**<font color="red">Beware, using &lt; instead of &lt;= will not work!</font>**
<pre>
mysql> select Name,Id from Student 
       where Age &lt; all
      (select Age from Student)
      
Empty set (0.00 sec      
</pre>

##### **5. Find the CS class with the least enrollment**
<pre>
  select CName from Enrollment 
  where CName like 'CS%' 
  group by CName
  having count(*) &lt;= all
    (select count(*) from Enrollment
     where CName like 'CS%'
     group by CName)
</pre>

In [34]:
query="""select CName from Enrollment 
  where CName like 'CS%' 
  group by CName
  having count(*) <= all
    (select count(*) from Enrollment
     where CName like 'CS%'
     group by CName)"""
doquery(query)

('CS 213',)
('CS 323',)

In [27]:
cursor.close()
mydb.close()